# Free Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointCloudEngine..::..Free Method
IPointCloudEngine Interface See Also
---
Revit will call this method when done using the engine.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
void Free()
```

Visual Basic
---
```text
Sub Free
```

Visual C++
---
```text
void Free()
```

# See Also
IPointCloudEngine Interface
Autodesk.Revit.DB.PointClouds Namespace